In [3]:
import pandas as pd
df=pd.read_csv('smallgradesh.csv',header=None)
df.head()

         0      1
0     Name  Grade
1   Marcia   82.4
2   Kadeem   78.2
3     Nash   79.3
4  Noelani   83.2

In [ ]:
## Chapter:1

In [5]:
df=pd.read_csv('gradedata.csv')
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [8]:
df=pd.read_csv('smallgrades.csv',names=['Names','Grades'])
df.head()

     Names  Grades
0   Marcia    82.4
1   Kadeem    78.2
2     Nash    79.3
3  Noelani    83.2
4  Noelani    87.4

In [9]:
# saving data to a csv

In [10]:
names=['Bob','Hessica','Berry','John','Mel']
grades=[98,39,49,55,60]
gradelist=zip(names,grades)

In [12]:
df=pd.DataFrame(data=gradelist,columns=['Names','Grades'])

In [13]:
df

     Names  Grades
0      Bob      98
1  Hessica      39
2    Berry      49
3     John      55
4      Mel      60

In [14]:
####

In [15]:
import pandas as pd
from numpy import random
from numpy.random import randint

In [16]:
names=['Bob','Jessica','Mary','John','Mel']

In [17]:
randnames=[]
for i in range(20):
    name=names[randint(low=0,high=len(names))]
    randnames.append(name)

In [19]:
# print(randnames)

In [26]:
random.seed(100)

In [27]:
p=names[randint(0,len(names))]

In [33]:
births=[]
for i in range(20):
    num=randint(0,20)
    births.append(num)

In [34]:
births

[3, 7, 15, 16, 10, 2, 2, 2, 14, 2, 17, 16, 15, 4, 11, 16, 9, 2, 12, 4]

In [35]:
#### Chapter 2

In [36]:
df=pd.read_csv('gradedata.csv')
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [37]:
df['grade'].mean()

82.55605000000001

In [39]:
df.describe()

               age     exercise        hours        grade
count  2000.000000  2000.000000  2000.000000  2000.000000
mean     16.578500     3.000500    10.988500    82.556050
std       1.696254     1.423205     4.063942     9.747593
min      14.000000     0.000000     0.000000    32.000000
25%      15.000000     2.000000     8.000000    75.575000
50%      17.000000     3.000000    11.000000    82.700000
75%      18.000000     4.000000    14.000000    89.700000
max      19.000000     5.000000    20.000000   100.000000

In [48]:
# missing data in a dataframe-pending try for some other data

In [49]:
## filter our inappropriate value

In [64]:
names

['Bob', 'Jessica', 'Mary', 'John', 'Mel']

In [65]:
grades.pop()

101

In [66]:
grades.append(101)

In [67]:
grades

[98, 39, 49, 55, 101]

In [68]:
GradeList =zip(names,grades)

In [69]:
df=pd.DataFrame(GradeList,columns=['Names','Grades'])
df

     Names  Grades
0      Bob      98
1  Jessica      39
2     Mary      49
3     John      55
4      Mel     101

In [70]:
df[df['Grades']>100]

  Names  Grades
4   Mel     101

In [81]:
df.loc[df['Grades']>100,'Grades']=100

In [82]:
df

     Names  Grades
0      Bob      98
1  Jessica      39
2     Mary      49
3     John      55
4      Mel     100

In [86]:
df['Grades']>100

0    False
1    False
2    False
3    False
4    False
Name: Grades, dtype: bool

In [85]:
df.loc[4,'Names']

'Mel'

In [87]:
df.loc[4,:]

Names     Mel
Grades    100
Name: 4, dtype: object

In [88]:
###################### removing duplicate data: Done on movies data set

In [91]:
####### removing punctuation from address

In [92]:
df=pd.read_csv('gradedata.csv')
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [93]:
import string
exclude=set(string.punctuation)
def remove_punctuation(x):
    try:
        x=''.join(ch for ch in x if ch not in exclude)
    except:
        pass
    return x

In [94]:
df.address=df.address.apply(remove_punctuation)

In [95]:
df

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,9253 Richardson Road Matawan NJ 07747
1,Kadeem,Morrison,male,18,4,4,78.2,33 Spring Dr Taunton MA 02780
2,Nash,Powell,male,18,5,9,79.3,41 Hill Avenue Mentor OH 44060
3,Noelani,Wagner,female,14,2,7,83.2,8839 Marshall St Miami FL 33125
4,Noelani,Cherry,female,18,4,15,87.4,8304 Charles Rd Lewis Center OH 43035
...,...,...,...,...,...,...,...,...
1995,Cody,Shepherd,male,19,1,8,80.1,982 West Street Alexandria VA 22304
1996,Geraldine,Peterson,female,16,4,18,100.0,78 Morris Street East Northport NY 11731
1997,Mercedes,Leon,female,18,3,14,84.9,30 Glenridge Rd Bountiful UT 84010
1998,Lucius,Rowland,male,16,1,7,69.1,342 West Meadowbrook Lane Helena MT 59601
1999,Linus,Morris,male,19,4,10,79.6,81 Homestead Drive Voorhees NJ 08043

In [106]:
def rem(x):
    print(x)
    x=''.join(ch for ch in x if ch not in exclude)
    return x

In [107]:
rem('How! did. you, not ! come')

How! did. you, not ! come

'How did you not  come'

In [108]:
df['address']

0           9253 Richardson Road Matawan NJ 07747
1                   33 Spring Dr Taunton MA 02780
2                  41 Hill Avenue Mentor OH 44060
3                 8839 Marshall St Miami FL 33125
4           8304 Charles Rd Lewis Center OH 43035
                          ...
1995          982 West Street Alexandria VA 22304
1996     78 Morris Street East Northport NY 11731
1997           30 Glenridge Rd Bountiful UT 84010
1998    342 West Meadowbrook Lane Helena MT 59601
1999         81 Homestead Drive Voorhees NJ 08043
Name: address, Length: 2000, dtype: object

In [109]:
def remove_white(x):
    x=''.join(x.split())
    return x

In [110]:
df.address=df.address.apply(remove_white)

In [111]:
df.address

0          9253RichardsonRoadMatawanNJ07747
1                  33SpringDrTauntonMA02780
2                 41HillAvenueMentorOH44060
3                8839MarshallStMiamiFL33125
4           8304CharlesRdLewisCenterOH43035
                       ...
1995         982WestStreetAlexandriaVA22304
1996     78MorrisStreetEastNorthportNY11731
1997          30GlenridgeRdBountifulUT84010
1998    342WestMeadowbrookLaneHelenaMT59601
1999        81HomesteadDriveVoorheesNJ08043
Name: address, Length: 2000, dtype: object

In [112]:
# Ranking grades and creating a new column based on the conditionals

In [113]:
df=pd.read_csv('gradedata.csv')
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [114]:
df.sort_values('grade',ascending=False).head(10)

,fname,lname,gender,age,exercise,hours,grade,address
355,Kadeem,Marshall,male,17,5,18,100.0,"56 North Glen Creek St., San Lorenzo, CA 94580"
1071,Clark,Baker,male,16,5,18,100.0,"9895 Beach Drive, Elizabeth City, NC 27909"
954,Athena,Harvey,female,19,5,20,100.0,"137 Cedar Swamp Street, Laurel, MD 20707"
1098,Ria,Cannon,female,14,5,16,100.0,"9095 Bow Ridge Street, Ashburn, VA 20147"
868,Craig,Moses,male,19,4,19,100.0,"7218 Grove Rd., Melbourne, FL 32904"
690,Sylvester,Payne,male,17,5,20,100.0,"242 Goldfield Ave., Encino, CA 91316"
1192,Blythe,Snyder,female,16,4,18,100.0,"104 Vale Dr., Graham, NC 27253"
1835,Maxwell,Blake,male,15,2,17,100.0,"30 Hawthorne Ave., Norfolk, VA 23503"
1834,Phillip,Savage,male,19,2,19,100.0,"579 High Ridge Rd., Matawan, NJ 07747"
226,Uriah,Cummings,male,18,3,20,100.0,"444 West Homestead Rd., Lebanon, PA 17042"

In [115]:
df['grade_ranked']=df['grade'].rank(ascending=1)

In [116]:
df.head(10)

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",963.0
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780",676.0
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060",746.0
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125",1035.5
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5
5,Neil,Whitley,male,16,5,16,88.7,"40 Washington Ave., Bloomfield, NJ 07003",1435.0
6,Nelle,Golden,female,17,1,9,80.2,"9768 Hanover Dr., Meadville, PA 16335",804.5
7,Armando,Hoffman,male,17,5,18,95.1,"360 Manor Drive, Northville, MI 48167",1781.5
8,Illiana,Rojas,female,15,5,9,76.5,"9425 Studebaker Dr., Thibodaux, LA 70301",562.0
9,Neil,Wooten,male,15,3,15,89.7,"400 Bridge Court, Soddy Daisy, TN 37379",1503.0

In [117]:
df.loc[355]

fname                                                   Kadeem
lname                                                 Marshall
gender                                                    male
age                                                         17
exercise                                                     5
hours                                                       18
grade                                                      100
address         56 North Glen Creek St., San Lorenzo, CA 94580
grade_ranked                                              1957
Name: 355, dtype: object

In [119]:
df[df['grade_ranked']==1]

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked
664,Alika,Poole,female,19,2,16,32.0,"9282 Purple Finch Lane, Lexington, NC 27292",1.0

In [120]:
df.shape

(2000, 9)

In [124]:
df[df['grade_ranked']<21].sort_values('grade_ranked')

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked
664,Alika,Poole,female,19,2,16,32.0,"9282 Purple Finch Lane, Lexington, NC 27292",1.0
972,Keegan,Rasmussen,male,19,4,3,43.0,"876 East Pilgrim Street, Chelmsford, MA 01824",2.0
1870,Levi,Coleman,male,19,3,3,55.9,"9453 Laurel Street, Jersey City, NJ 07302",3.0
1910,Gail,Mcneil,female,17,2,3,56.1,"8409A Spruce St., Fishers, IN 46037",4.0
1494,Jenna,Wagner,female,16,1,3,56.3,"8829 Shore Dr., Hopewell Junction, NY 12533",5.0
556,Lacey,Nieves,female,18,1,2,57.9,"38 West Brickyard Avenue, Roslindale, MA 02131",6.0
340,Abbot,Hall,male,16,4,3,58.9,"84 Rock Creek Lane, Durham, NC 27703",7.5
1068,Isaiah,Harrington,male,17,1,4,58.9,"47 Mill Pond St., Haines City, FL 33844",7.5
410,Linda,Baldwin,female,16,5,2,59.0,"970 SW. Second Ave., Cedar Falls, IA 50613",9.0
1237,Willa,Byers,female,14,2,4,59.2,"9466 Wayne Lane, Torrington, CT 06790",10.0
672,Ciaran,Gay,male,19,4,3,59.3,"157 Bridge Street, Corona, NY 11368",11.0
1207,Selma,Stout,female,19,2,3,59.4,"5 Pierce St., Chester, PA 19013",12.0
1882,Fitzgerald,Goff,male,18,1,4,59.8,"3 West Shipley Rd., Langhorne, PA 19047",13.5
1924,Xanthus,Mcneil,male,16,3,4,59.8,"226 Redwood Lane, Boynton Beach, FL 33435",13.5
700,Steven,Sherman,male,18,1,2,60.0,"8029 Depot Street, Port Charlotte, FL 33952",15.0
1916,Kevin,Townsend,male,14,5,2,60.1,"9805 Walnutwood Dr., Panama City, FL 32404",16.5
528,Chester,Vance,male,17,1,5,60.1,"732 Randall Mill Street, Covington, GA 30014",16.5
1590,Dillon,Kane,male,19,2,4,60.3,"141 SW. Birchpond Ave., Germantown, MD 20874",18.5
388,Colton,Ochoa,male,17,1,4,60.3,"75 Arrowhead Drive, Danvers, MA 01923",18.5
869,Tanek,Stephens,male,15,1,4,60.5,"167 Glen Eagles St., Merrimack, NH 03054",20.5
1512,Jermaine,Sims,male,16,2,3,60.5,"7994 Leatherwood St., Pittsfield, MA 01201",20.5

In [126]:
import numpy as np
df['is_failing']=np.where(df['grade']<70,'yes','no')

In [127]:
df.head()

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked,is_failing
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",963.0,no
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780",676.0,no
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060",746.0,no
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125",1035.5,no
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5,no

In [128]:
df['age'].head()

0    17
1    18
2    18
3    14
4    18
Name: age, dtype: int64

In [129]:
df[['gender','age']].head

   gender  age
0  female   17
1    male   18
2    male   18
3  female   14
4  female   18

In [130]:
df[:2]

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked,is_failing
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",963.0,no
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780",676.0,no

In [132]:
df[df['grade']>80].head()

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked,is_failing
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",963.0,no
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125",1035.5,no
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5,no
5,Neil,Whitley,male,16,5,16,88.7,"40 Washington Ave., Bloomfield, NJ 07003",1435.0,no
6,Nelle,Golden,female,17,1,9,80.2,"9768 Hanover Dr., Meadville, PA 16335",804.5,no

In [135]:
df[(df['grade']>80) & (df['gender']=='female')]

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked,is_failing
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",963.0,no
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125",1035.5,no
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5,no
6,Nelle,Golden,female,17,1,9,80.2,"9768 Hanover Dr., Meadville, PA 16335",804.5,no
12,Quinn,Warren,female,14,4,12,80.7,"760 Smith Street, Appleton, WI 54911",844.5,no
...,...,...,...,...,...,...,...,...,...,...
1980,Maxine,Raymond,female,17,4,19,91.9,"739 Thomas Court, Memphis, TN 38106",1636.5,no
1981,Leah,Lawrence,female,15,5,15,100.0,"652 Pine Drive, Mountain View, CA 94043",1957.0,no
1986,Indigo,Mccoy,female,19,2,14,91.3,"9652 Columbia Ave., Chattanooga, TN 37421",1604.0,no
1996,Geraldine,Peterson,female,16,4,18,100.0,"78 Morris Street, East Northport, NY 11731",1957.0,no
1997,Mercedes,Leon,female,18,3,14,84.9,"30 Glenridge Rd., Bountiful, UT 84010",1158.5,no

In [142]:
df_series=df[df['grade']>80]['fname']

In [147]:
df[(df['grade']>80) & (df['gender']=='female')]

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked,is_failing
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",963.0,no
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125",1035.5,no
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5,no
6,Nelle,Golden,female,17,1,9,80.2,"9768 Hanover Dr., Meadville, PA 16335",804.5,no
12,Quinn,Warren,female,14,4,12,80.7,"760 Smith Street, Appleton, WI 54911",844.5,no
...,...,...,...,...,...,...,...,...,...,...
1980,Maxine,Raymond,female,17,4,19,91.9,"739 Thomas Court, Memphis, TN 38106",1636.5,no
1981,Leah,Lawrence,female,15,5,15,100.0,"652 Pine Drive, Mountain View, CA 94043",1957.0,no
1986,Indigo,Mccoy,female,19,2,14,91.3,"9652 Columbia Ave., Chattanooga, TN 37421",1604.0,no
1996,Geraldine,Peterson,female,16,4,18,100.0,"78 Morris Street, East Northport, NY 11731",1957.0,no
1997,Mercedes,Leon,female,18,3,14,84.9,"30 Glenridge Rd., Bountiful, UT 84010",1158.5,no

In [148]:
df.head()

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked,is_failing
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",963.0,no
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780",676.0,no
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060",746.0,no
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125",1035.5,no
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5,no

In [149]:
# find all students living in Ohio(OH)

In [153]:
df[df['fname'].str.contains('Noelani')]

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked,is_failing
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125",1035.5,no
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5,no
527,Noelani,Villarreal,female,19,1,5,75.4,"276 East Oxford Street, Lincolnton, NC 28092",494.0,no

In [154]:
df[df['address'].str.contains('OH')]

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked,is_failing
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060",746.0,no
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5,no
56,Tate,Dunlap,male,17,2,6,67.7,"256 High Street, Youngstown, OH 44512",135.5,yes
93,Cody,Lara,male,18,1,6,69.0,"12 South Crescent Street, Mason, OH 45040",176.5,yes
99,Yetta,Howell,female,17,3,13,89.2,"348 Tailwater Lane, Hilliard, OH 43026",1472.5,no
...,...,...,...,...,...,...,...,...,...,...
1891,Halla,Norman,female,15,1,7,68.4,"7719 St Margarets Lane, Reynoldsburg, OH 43068",163.0,yes
1909,Reece,Baker,male,14,1,12,84.6,"8 St Louis Ave., Pataskala, OH 43062",1145.0,no
1913,Maxwell,Phelps,male,14,3,7,68.7,"173 Bow Ridge Street, New Philadelphia, OH 44663",168.0,yes
1918,Lionel,Dodson,male,18,4,13,84.9,"93 S. El Dorado Dr., Alliance, OH 44601",1158.5,no
1972,Fritz,Rojas,male,17,5,13,79.5,"16 East Edgewood St., Ashtabula, OH 44004",762.0,no

In [155]:
df.loc[df['address'].str.contains('OH')]

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked,is_failing
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060",746.0,no
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5,no
56,Tate,Dunlap,male,17,2,6,67.7,"256 High Street, Youngstown, OH 44512",135.5,yes
93,Cody,Lara,male,18,1,6,69.0,"12 South Crescent Street, Mason, OH 45040",176.5,yes
99,Yetta,Howell,female,17,3,13,89.2,"348 Tailwater Lane, Hilliard, OH 43026",1472.5,no
...,...,...,...,...,...,...,...,...,...,...
1891,Halla,Norman,female,15,1,7,68.4,"7719 St Margarets Lane, Reynoldsburg, OH 43068",163.0,yes
1909,Reece,Baker,male,14,1,12,84.6,"8 St Louis Ave., Pataskala, OH 43062",1145.0,no
1913,Maxwell,Phelps,male,14,3,7,68.7,"173 Bow Ridge Street, New Philadelphia, OH 44663",168.0,yes
1918,Lionel,Dodson,male,18,4,13,84.9,"93 S. El Dorado Dr., Alliance, OH 44601",1158.5,no
1972,Fritz,Rojas,male,17,5,13,79.5,"16 East Edgewood St., Ashtabula, OH 44004",762.0,no

In [158]:
df.is_failing=[x.upper() for x in df.is_failing]

In [159]:
df.head()

,fname,lname,gender,age,exercise,hours,grade,address,grade_ranked,is_failing
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",963.0,NO
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780",676.0,NO
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060",746.0,NO
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125",1035.5,NO
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5,NO

In [161]:
header=list(df.columns.values)

In [162]:
header

['fname',
 'lname',
 'gender',
 'age',
 'exercise',
 'hours',
 'grade',
 'address',
 'grade_ranked',
 'is_failing']

In [164]:
header[0]='FNAME'
header[1]='LNAME'

df.columns=header

In [165]:
df.head(2)

,FNAME,LNAME,gender,age,exercise,hours,grade,address,grade_ranked,is_failing
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",963.0,NO
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780",676.0,NO

In [166]:
# removing columns

In [167]:
df_copy=df.copy()

In [170]:
df_copy.drop('is_failing',axis=1,inplace=True)

In [171]:
df_copy.head()

,FNAME,LNAME,gender,age,exercise,hours,grade,address,grade_ranked
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",963.0
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780",676.0
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060",746.0
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125",1035.5
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5

In [172]:
df_copy['empty']=0

In [174]:
df_copy.head()

,FNAME,LNAME,gender,age,exercise,hours,grade,address,grade_ranked,empty
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",963.0,0
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780",676.0,0
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060",746.0,0
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125",1035.5,0
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5,0

In [175]:
df_copy['new']=np.nan

In [176]:
df_copy.head()

,FNAME,LNAME,gender,age,exercise,hours,grade,address,grade_ranked,empty,new
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",963.0,0,NaN
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780",676.0,0,NaN
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060",746.0,0,NaN
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125",1035.5,0,NaN
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035",1331.5,0,NaN

In [177]:
df_copy.dtypes

FNAME            object
LNAME            object
gender           object
age               int64
exercise          int64
hours             int64
grade           float64
address          object
grade_ranked    float64
empty             int64
new             float64
dtype: object

In [182]:
df_copy['empty']=df_copy['empty'].astype('float')

In [183]:
df_copy.dtypes

FNAME            object
LNAME            object
gender           object
age               int64
exercise          int64
hours             int64
grade           float64
address          object
grade_ranked    float64
empty           float64
new             float64
dtype: object

In [184]:
# using bins

In [203]:
df=pd.read_csv('gradedata.csv')
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [204]:
df_bins=df[['fname','lname','gender','age','hours','grade']]

In [205]:
df_bins.head()

     fname     lname  gender  age  hours  grade
0   Marcia      Pugh  female   17     10   82.4
1   Kadeem  Morrison    male   18      4   78.2
2     Nash    Powell    male   18      9   79.3
3  Noelani    Wagner  female   14      7   83.2
4  Noelani    Cherry  female   18     15   87.4

In [206]:
bins=[0,60,70,80,90,100]
group_names=['F','D','C','B','A']

In [207]:
df_bins['letter_grades']=pd.cut(df_bins['grade'],bins,labels=group_names)

C:\Users\soheb\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [208]:
df_bins.head()

     fname     lname  gender  age  hours  grade letter_grades
0   Marcia      Pugh  female   17     10   82.4             B
1   Kadeem  Morrison    male   18      4   78.2             C
2     Nash    Powell    male   18      9   79.3             C
3  Noelani    Wagner  female   14      7   83.2             B
4  Noelani    Cherry  female   18     15   87.4             B

In [214]:
df_bins.groupby('letter_grades')['hours'].mean()

letter_grades
F     3.933333
D     5.544041
C     8.381034
B    11.827680
A    15.305263
Name: hours, dtype: float64

In [215]:
# count the number of students according to their grades

In [221]:
df_bins['letter_grades'].value_counts()

B    737
C    580
A    475
D    193
F     15
Name: letter_grades, dtype: int64